; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 12 parts and 200% wood
; Machines:
;   2 highspeed-saw
;   2 glazer
;   2 grinder
;   2 immersion-varnisher
;   2 planer
;   2 saw
;   2 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 - highspeed-saw
    glazer0 glazer1 - glazer
    grinder0 grinder1 - grinder
    immersion-varnisher0 immersion-varnisher1 - immersion-varnisher
    planer0 planer1 - planer
    saw0 saw1 - saw
    spray-varnisher0 spray-varnisher1 - spray-varnisher
    blue black green mauve red white - acolour
    teak pine beech - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - part
    b0 b1 b2 b3 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (boardsize-successor s9 s10)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (has-colour glazer0 natural)
    (has-colour glazer0 mauve)
    (has-colour glazer0 white)
    (has-colour glazer1 natural)
    (has-colour glazer1 white)
    (has-colour immersion-varnisher0 mauve)
    (has-colour immersion-varnisher0 white)
    (has-colour immersion-varnisher1 mauve)
    (has-colour immersion-varnisher1 white)
    (has-colour spray-varnisher0 mauve)
    (has-colour spray-varnisher0 white)
    (has-colour spray-varnisher1 mauve)
    (has-colour spray-varnisher1 white)
    (unused p0)
    (goalsize p0 medium)
    (= (spray-varnish-cost p0) 10)
    (= (glaze-cost p0) 15)
    (= (grind-cost p0) 30)
    (= (plane-cost p0) 20)
    (available p1)
    (treatment p1 varnished)
    (surface-condition p1 verysmooth)
    (wood p1 pine)
    (colour p1 black)
    (goalsize p1 medium)
    (= (spray-varnish-cost p1) 10)
    (= (glaze-cost p1) 15)
    (= (grind-cost p1) 30)
    (= (plane-cost p1) 20)
    (unused p2)
    (goalsize p2 small)
    (= (spray-varnish-cost p2) 5)
    (= (glaze-cost p2) 10)
    (= (grind-cost p2) 15)
    (= (plane-cost p2) 10)
    (unused p3)
    (goalsize p3 large)
    (= (spray-varnish-cost p3) 15)
    (= (glaze-cost p3) 20)
    (= (grind-cost p3) 45)
    (= (plane-cost p3) 30)
    (unused p4)
    (goalsize p4 medium)
    (= (spray-varnish-cost p4) 10)
    (= (glaze-cost p4) 15)
    (= (grind-cost p4) 30)
    (= (plane-cost p4) 20)
    (unused p5)
    (goalsize p5 medium)
    (= (spray-varnish-cost p5) 10)
    (= (glaze-cost p5) 15)
    (= (grind-cost p5) 30)
    (= (plane-cost p5) 20)
    (available p6)
    (treatment p6 varnished)
    (surface-condition p6 smooth)
    (wood p6 teak)
    (colour p6 blue)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 large)
    (= (spray-varnish-cost p7) 15)
    (= (glaze-cost p7) 20)
    (= (grind-cost p7) 45)
    (= (plane-cost p7) 30)
    (unused p8)
    (goalsize p8 large)
    (= (spray-varnish-cost p8) 15)
    (= (glaze-cost p8) 20)
    (= (grind-cost p8) 45)
    (= (plane-cost p8) 30)
    (available p9)
    (treatment p9 colourfragments)
    (surface-condition p9 smooth)
    (wood p9 beech)
    (colour p9 blue)
    (goalsize p9 medium)
    (= (spray-varnish-cost p9) 10)
    (= (glaze-cost p9) 15)
    (= (grind-cost p9) 30)
    (= (plane-cost p9) 20)
    (available p10)
    (treatment p10 varnished)
    (surface-condition p10 verysmooth)
    (wood p10 beech)
    (colour p10 black)
    (goalsize p10 small)
    (= (spray-varnish-cost p10) 5)
    (= (glaze-cost p10) 10)
    (= (grind-cost p10) 15)
    (= (plane-cost p10) 10)
    (available p11)
    (treatment p11 glazed)
    (surface-condition p11 smooth)
    (wood p11 pine)
    (colour p11 white)
    (goalsize p11 small)
    (= (spray-varnish-cost p11) 5)
    (= (glaze-cost p11) 10)
    (= (grind-cost p11) 15)
    (= (plane-cost p11) 10)
    (boardsize b0 s8)
    (wood b0 beech)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s8)
    (wood b1 teak)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s10)
    (wood b2 teak)
    (surface-condition b2 rough)
    (available b2)
    (boardsize b3 s6)
    (wood b3 pine)
    (surface-condition b3 rough)
    (available b3)
  )
  (:goal
    (and
    (available p0)
    (wood p0 beech)
    (surface-condition p0 verysmooth)
    (available p1)
    (wood p1 pine)
    (surface-condition p1 smooth)
    (available p2)
    (wood p2 teak)
    (treatment p2 varnished)
    (surface-condition p2 smooth)
    (available p3)
    (treatment p3 glazed)
    (colour p3 white)
    (wood p3 teak)
    (surface-condition p3 smooth)
    (available p4)
    (wood p4 teak)
    (colour p4 white)
    (available p5)
    (treatment p5 glazed)
    (surface-condition p5 verysmooth)
    (available p6)
    (treatment p6 varnished)
    (colour p6 white)
    (available p7)
    (colour p7 mauve)
    (surface-condition p7 smooth)
    (available p8)
    (wood p8 pine)
    (colour p8 mauve)
    (treatment p8 varnished)
    (surface-condition p8 verysmooth)
    (available p9)
    (treatment p9 glazed)
    (surface-condition p9 verysmooth)
    (available p10)
    (treatment p10 glazed)
    (colour p10 natural)
    (available p11)
    (wood p11 pine)
    (treatment p11 varnished)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-medium b1 p4 saw0 teak rough s8 s7 s6)
   deleted: (unused p4)
   added: (available p4) (wood p4 teak) (surface-condition p4 rough) (colour p4 natural) (treatment p4 untreated) (boardsize b1 s6)
   goals met: 10 of 41
2. (do-saw-medium b0 p5 saw0 beech rough s8 s7 s6)
   deleted: (unused p5)
   added: (available p5) (wood p5 beech) (surface-condition p5 rough) (colour p5 natural) (treatment p5 untreated) (boardsize b0 s6)
   goals met: 11 of 41
3. (do-saw-large b1 p3 saw0 teak rough s6 s4 s5 s3)
   deleted: (unused p3)
   added: (available p3) (wood p3 teak) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b1 s3)
   goals met: 13 of 41
4. (do-saw-large b0 p7 saw0 beech rough s6 s4 s5 s3)
   deleted: (unused p7)
   added: (available p7) (wood p7 beech) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b0 s3)
   goals met: 14 of 41
5. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 15 of 41
6. (do-plane p5 planer0 rough natural untreated)
   deleted: (surface-condition p5 rough)
   added: (surface-condition p5 smooth)
   goals met: 15 of 41
7. (do-plane p3 planer0 rough natural untreated)
   deleted: (surface-condition p3 rough)
   added: (surface-condition p3 smooth)
   goals met: 16 of 41
8. (do-plane p10 planer0 verysmooth black varnished)
   deleted: (surface-condition p10 verysmooth) (treatment p10 varnished) (colour p10 black)
   added: (surface-condition p10 smooth) (treatment p10 untreated) (colour p10 natural)
   goals met: 17 of 41
9. (do-plane p1 planer0 verysmooth black varnished)
   deleted: (surface-condition p1 verysmooth) (treatment p1 varnished) (colour p1 black)
   added: (surface-condition p1 smooth) (treatment p1 untreated) (colour p1 natural)
   goals met: 18 of 41
10. (do-grind p9 grinder0 smooth blue colourfragments untreated)
   deleted: (surface-condition p9 smooth) (treatment p9 colourfragments) (colour p9 blue)
   added: (surface-condition p9 verysmooth) (treatment p9 untreated) (colour p9 natural)
   goals met: 19 of 41
11. (do-grind p5 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p5 smooth)
   added: (surface-condition p5 verysmooth)
   goals met: 20 of 41
12. (do-grind p11 grinder0 smooth white glazed untreated)
   deleted: (surface-condition p11 smooth) (treatment p11 glazed) (colour p11 white)
   added: (surface-condition p11 verysmooth) (treatment p11 untreated) (colour p11 natural)
   goals met: 20 of 41
13. (do-glaze p9 glazer0 mauve)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 glazed) (colour p9 mauve)
   goals met: 21 of 41
14. (do-glaze p7 glazer0 mauve)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 mauve)
   goals met: 22 of 41
15. (do-glaze p5 glazer0 mauve)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 glazed) (colour p5 mauve)
   goals met: 23 of 41
16. (do-glaze p4 glazer0 white)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 glazed) (colour p4 white)
   goals met: 24 of 41
17. (do-glaze p3 glazer0 white)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 white)
   goals met: 26 of 41
18. (do-glaze p10 glazer0 natural)
   deleted: (treatment p10 untreated)
   added: (treatment p10 glazed)
   goals met: 27 of 41
19. (do-immersion-varnish p11 immersion-varnisher0 mauve verysmooth)
   deleted: (treatment p11 untreated) (colour p11 natural)
   added: (treatment p11 varnished) (colour p11 mauve)
   goals met: 28 of 41
20. (do-plane p6 planer0 smooth blue varnished)
   deleted: (treatment p6 varnished) (colour p6 blue)
   added: (treatment p6 untreated) (colour p6 natural)
   goals met: 27 of 41
21. (do-immersion-varnish p6 immersion-varnisher0 white smooth)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 varnished) (colour p6 white)
   goals met: 29 of 41
22. (do-saw-large b3 p8 saw0 pine rough s6 s4 s5 s3)
   deleted: (unused p8)
   added: (available p8) (wood p8 pine) (surface-condition p8 rough) (colour p8 natural) (treatment p8 untreated) (boardsize b3 s3)
   goals met: 31 of 41
23. (do-plane p8 planer0 rough natural untreated)
   deleted: (surface-condition p8 rough)
   added: (surface-condition p8 smooth)
   goals met: 31 of 41
24. (do-grind p8 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p8 smooth)
   added: (surface-condition p8 verysmooth)
   goals met: 32 of 41
25. (do-immersion-varnish p8 immersion-varnisher0 mauve verysmooth)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 varnished) (colour p8 mauve)
   goals met: 34 of 41
26. (do-saw-medium b0 p0 saw0 beech rough s3 s2 s1)
   deleted: (unused p0)
   added: (available p0) (wood p0 beech) (surface-condition p0 rough) (colour p0 natural) (treatment p0 untreated) (boardsize b0 s1)
   goals met: 36 of 41
27. (do-plane p0 planer0 rough natural untreated)
   deleted: (surface-condition p0 rough)
   added: (surface-condition p0 smooth)
   goals met: 36 of 41
28. (do-grind p0 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p0 smooth)
   added: (surface-condition p0 verysmooth)
   goals met: 37 of 41
29. (do-saw-small b1 p2 saw0 teak rough s3 s2)
   deleted: (unused p2)
   added: (available p2) (wood p2 teak) (surface-condition p2 rough) (colour p2 natural) (treatment p2 untreated) (boardsize b1 s2)
   goals met: 39 of 41
30. (do-plane p2 planer0 rough natural untreated)
   deleted: (surface-condition p2 rough)
   added: (surface-condition p2 smooth)
   goals met: 40 of 41
31. (do-immersion-varnish p2 immersion-varnisher0 mauve smooth)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 varnished) (colour p2 mauve)
   goals met: 41 of 41
